---
layout: post
title: "博客系统迁移记录"
date:   2023-1-1
tags: [notice]
comments: true
author: nekocatso
---
博客系统迁移记录

本博客采用的是开源HALO博客系统，搭建于2021年11月份使用的版本为1.4.8，halo博客系统一直在迭代更新直到2022年12月1日发布了2.0版本，因为 Halo 2.0 的底层架构变动，无法兼容 1.x 的数据，导致无法平滑升级，所以需要进行数据迁移。虽然作者提供了迁移插件但是迁移后还是存在很多问题，如主题需要重新兼容，博客的附件无法迁移，所有的文章附件图片无法关联显示等等问题。

本站在权衡所有利弊后在2022年12月31日对博客系统进行了升级，从1.6.1版本升级到2.1.0版本。新版本的迁移是比较顺利的但是整个网站的重新配置是比较费时间的，从博客主题（https://github.com/LIlGG/halo-theme-sakura）的配置到插件的配置再到live2d看板娘（https://github.com/LIlGG/plugin-live2d）api的搭建都不算很顺利，花费了很长的时间。

由于底层架构的变更有很多东西无法适配，本站已经尽量还原最初的样子，有很多的文章附件需要重新关联，考虑到有些软件版本迭代比较大，教程比较旧不太适用的问题后续会对所有的教程进行更新迭代最新的版本，这需要很长的时间本人更新比较佛系看心情，大家耐心等待即可。也可以评论留言催更你想看的教程。